[
    {
        "problem": "George saves nickels, dimes, quarters, half-dollars, and dollar coins for tolls. He has a total of 40 coins that amount to $9.10. It is known that the number of nickels plus twice the number of dimes equals three times the number of quarters plus 34. The number of nickels plus the number of dimes plus the number of quarters equals four times the number of half-dollars plus 26. The number of nickels plus the number of dimes plus the number of quarters plus the number of half-dollars equals five times the number of dollar coins plus 16. How many coins does George have of each type?",
        "system_of_equations": [
            "0.05 * x + 0.1 * y + 0.25 * z + 0.5 * w + 1.0 * v  = 9.10000000000000",
            "x + y + z + w + v  = 40.0000000000000",
            "x + 2 * y  = 3 * z + 34.0",
            "x + y + z  = 4 * w + 26.0",
            "x + y + z + w  = 5 * v + 16.0"
        ],
        "ans": [
            "4",
            "24",
            "6",
            "2",
            "4"
        ],
        "id": "27"
    },
    {
        "problem": "You invest $ 12,000 in five different accounts. The first account pays 8 % annual interest, the second account pays 10 % annual interest, the third account pays 6 % annual interest, the fourth account pays 5% annual interest, and the fifth account pays 7% annual interest. At the end of the year, the first and second accounts earn the same amount of interest, while the third account earns 212 dollars less than the second account. The fourth account earns 270 dollars less than the second account, and the fifth account earns 180 dollars less than the second account. How much was invested in each account?",
        "system_of_equations": [
            "( 0.01 * 8.0 ) * x  = 0.1 * y",
            "( 0.01 * 6.0 ) * z  = 0.1 * y - 212.0",
            "y + z + w + v  = 12000.0 - x",
            "( 0.01 * 5.0 ) * w  = 0.1 * y - 270.0",
            "( 0.01 * 7.0 ) * v  = 0.1 * y - 180.0"
        ],
        "ans": [
            "4000",
            "3200",
            "1800",
            "1000",
            "2000"
        ],
        "id": "39"
    },
    {
        "problem": "A piggy bank contains $26.05 in half-dollars, quarters, dimes, nickels, and pennies. There are a total of 160 coins. The number of dimes plus twice the number of quarters equals four times the number of nickels plus 85. The number of dimes plus the number of quarters plus the number of nickels equals five times the number of pennies minus 30. The number of dimes plus the number of quarters plus the number of nickels plus the number of pennies equals six times the number of half-dollars plus 90. How many half-dollars, quarters, dimes, nickels, and pennies are there in the piggy bank?",
        "system_of_equations": [
            "0.1 * x + 0.25 * y + 0.05 * z + 0.01 * w + 0.5 * v  = 26.0500000000000",
            "x + y + z + w + v  = 160",
            "x + 2 * y  = 4 * z + 85",
            "x + y + z  = 5 * w - 30.0",
            "x + y + z + w  = 6 * v + 90.0"
        ],
        "ans": [
            "35",
            "65",
            "20",
            "30",
            "10"
        ],
        "id": "375"
    },
    {
        "problem": "Allen went to the post office and bought 35 stamps in total. The stamps were in 37 cents, 20 cents, 50 cents, 30 cents, and 25 cents denominations. The total cost of the stamps was $12.31. It is known that the number of 37 cents stamps plus twice the number of 20 cents stamps equals three times the number of 50 cents stamps plus 7. The number of 37 cents stamps plus the number of 20 cents stamps plus the number of 50 cents stamps equals four times the number of 30 cents stamps plus 5. The number of 37 cents stamps plus the number of 20 cents stamps plus the number of 50 cents stamps plus the number of 30 cents stamps equals six times the number of 25 cents stamps. How many of each type of stamp did Allen buy?",
        "system_of_equations": [
            "0.01 * 37.0 * x + 0.01 * 20.0 * y + 0.01 * 50.0 * z + 0.01 * 30.0 * w + 0.01 * 25.0 * v  = 12.3100000000000",
            "x + y + z + w + v  = 35.0000000000000",
            "x + 2.0 * y  = 3.0 * z + 7.0",
            "x + y + z  = 4.0 * w + 5.0",
            "x + y + z + w  = 6.0 * v"
        ],
        "ans": [
            "18",
            "2",
            "5",
            "5",
            "5"
        ],
        "id": "54"
    },
    {
        "problem": "At a fruit market, 6 kilos of oranges, 5 kilos of apples, 2 kilos of bananas, 3 kilos of grapes, and 1 kilo of strawberries cost 504. Also, 5 kilos of oranges, 7 kilos of apples, 3 kilos of bananas, 2 kilos of grapes, and 1 kilo of strawberries cost 568. Furthermore, 4 kilos of oranges, 3 kilos of apples, 5 kilos of bananas, 1 kilo of grapes, and 1 kilo of strawberries cost 348. Lastly, 2 kilos of oranges, 2 kilos of apples, 1 kilo of bananas, 4 kilos of grapes, and 1 kilo of strawberries cost 246. One kilo of each fruit plus an additional kilo of strawberries cost 143. What is the cost per kilo for each type of fruit?",
        "system_of_equations": [
            "6.0 * x + 5.0 * y + 2.0 * z + 3.0 * w + 1.0 * v  = 504.000000000000",
            "5.0 * x + 7.0 * y + 3.0 * z + 2.0 * w + 1.0 * v  = 568.000000000000",
            "4.0 * x + 3.0 * y + 5.0 * z + 1.0 * w + 1.0 * v  = 348.000000000000",
            "2.0 * x + 2.0 * y + 1.0 * z + 4.0 * w + 1.0 * v  = 246.000000000000",
            "1.0 * x + 1.0 * y + 1.0 * z + 1.0 * w + 2.0 * v  = 143.000000000000"
        ],
        "ans": [
            "29",
            "49",
            "10",
            "15",
            "20"
        ],
        "id": "37"
    },
    {
        "problem": "The sum of five numbers is 27. The second number is equal to the fifth number plus the fourth number minus the first number and the third number plus 13. Three times the first number is 15 less than the sum of the negative fifth number, the fourth number, five times the second number, and the third number. Twice the first number plus the second number equals the fifth number plus the fourth number plus three times the third number plus 1. The sum of the first number, the second number, and the third number equals the fifth number plus four times the fourth number plus 4. The sum of the first number, the second number, the third number, and the fourth number equals three times the fifth number plus 11. Find the numbers.",
        "system_of_equations": [
            "y  = v + w - x - z + 13.0",
            "3.0 * x  = -v + w + 5.0 * y + z - 15.0",
            "2.0 * x + y  = v + w + 3.0 * z + 1.0",
            "x + y + z  = v + 4.0 * w + 4.0",
            "x + y + z + w  = 3.0 * v + 11.0"
        ],
        "ans": [
            "8",
            "7",
            "5",
            "3",
            "4"
        ],
        "id": "49"
    },
    {
        "problem": "During the early 1990s, Kelly invested 15,000 dollars into five different types of accounts within a bank: certificates of deposit, savings account, a money market account, a checking account, and a retirement account. She received 8% interest for her certificates of deposit, 6% for her savings account, 4% for her money market account, 2% for her checking account, and 1% for her retirement account. In total, she earned 690 dollars for the year. Also, the amount invested in certificates of deposit plus twice the amount invested in the savings account equals five times the amount invested in the money market account plus 3000 dollars. The amount invested in certificates of deposit plus the amount invested in the savings account plus the amount invested in the money market account equals four times the amount invested in the checking account plus 2000 dollars. The amount invested in certificates of deposit plus the amount invested in the savings account plus the amount invested in the money market account plus the amount invested in the checking account equals four times the amount invested in the retirement account. How much money was invested in each type of account?",
        "system_of_equations": [
            "0.01 * 8.0 * x + 0.01 * 6.0 * y + 0.01 * 4.0 * z + 0.01 * 2.0 * w + 0.01 * 1.0 * v  = 690.000000000000",
            "x + y + z + w + v  = 15000.0000000000",
            "x + 2.0 * y  = 5.0 * z + 3000.0",
            "x + y + z  = 4.0 * w + 2000.0",
            "x + y + z + w  = 4.0 * v"
        ],
        "ans": [
            "3000",
            "5000",
            "2000",
            "2000",
            "3000"
        ],
        "id": "32"
    },
    {
        "problem": "The sum of five numbers is 125. When four times the first number, the second number, half of the third number, a quarter of the fourth number, and a tenth of the fifth number are added together, the result is 164.5. Additionally, twice the first number plus the second number plus the fourth number plus the fifth number equals three times the third number plus 103. The sum of the first, second, third, and fifth numbers equals four times the fourth number plus 75. The sum of the first, second, third, and fourth numbers equals five times the fifth number plus 35. What are the five numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 125.000000000000",
            "4.0 * x + y + 0.5 * z + 0.25 * w + 0.1 * v  = 164.500000000000",
            "2.0 * x + y + w + v  = 3.0 * z + 103.0",
            "x + y + z + v  = 4.0 * w + 75.0",
            "x + y + z + w  = 5.0 * v + 35.0"
        ],
        "ans": [
            "22",
            "67",
            "11",
            "10",
            "15"
        ],
        "id": "35"
    },
    {
        "problem": "Stan invested $10,000 in five different ways: part at 8% annual interest, part at 17% annual interest, part at 5% annual interest, part at 3% annual interest, and the rest at 2% annual interest. After one year, he received $940 in interest. Also, twice the amount invested at 8% plus the amount invested at 17% equals ten times the amount invested at 5% minus $14,000. The amount invested at 8% annual interest plus the amount invested at 17% annual interest plus the amount invested at 5% annual interest equals four times the amount invested at 3% annual interest minus $1,000. The amount invested at 8% annual interest plus the amount invested at 17% annual interest plus the amount invested at 5% annual interest plus the amount invested at 3% annual interest equals five times the amount invested at 2% annual interest plus $4,000. How much did Stan invest at each rate?",
        "system_of_equations": [
            "0.01 * 8.0 * x + 0.01 * 17.0 * y + 0.01 * 5.0 * z + 0.01 * 3.0 * w + 0.01 * 2.0 * v  = 940.000000000000",
            "x + y + z + w + v  = 10000.00000000000",
            "2.0 * x + y  = 10.0 * z - 14000.0",
            "x + y + z  = 4.0 * w - 1000.0",
            "x + y + z + w  = 5.0 * v + 4000.0"
        ],
        "ans": [
            "1000",
            "4000",
            "2000",
            "2000",
            "1000"
        ],
        "id": "357"
    },
    {
        "problem": "In the lab, Chang is mixing five solutions that contain alcohol. He uses 500 milliliters less of Solution A than Solution B, 400 milliliters less of Solution C than Solution B, 300 milliliters less of Solution D than Solution B, and 100 milliliters more of Solution E than Solution B. Solution A is 16% alcohol, Solution B is 10% alcohol, Solution C is 20% alcohol, Solution D is 15% alcohol, and Solution E is 25% alcohol. If the resulting mixture contains 336 milliliters of pure alcohol, how many milliliters of each solution does he use?",
        "system_of_equations": [
            "0.01 * 10.0 * x + 0.01 * 16.0 * y + 0.01 * 20.0 * z + 0.01 * 15.0 * w + 0.01 * 25.0 * v  = 336.000000000000",
            "x - 500.0  = y",
            "x - 400.0  = z",
            "x - 300.0  = w",
            "x + 100.0  = v"
        ],
        "ans": [
            "600",
            "100",
            "200",
            "300",
            "700"
        ],
        "id": "392"
    },
    {
        "problem": "In a family, the dad is 4 times older than the son and the difference in their ages is 27 years. The mom is 3 times older than the son. The grandparent is twice as old as the dad. The aunt is 5 years younger than the mom. How old is the son, the dad, the mom, the grandparent, and the aunt?",
        "system_of_equations": [
            "x  = 4.0 * y",
            "x - y  = 27.0000000000000",
            "z  = 3.0 * y",
            "w  = 2.0 * x",
            "v  = z - 5.0"
        ],
        "ans": [
            "36",
            "9",
            "27",
            "72",
            "22"
        ],
        "id": "367"
    },
    {
        "problem": "The sum of five numbers is 27. The second number is three times as much as the first number. The third number is half of the second number minus 1.375. The fourth number is half of the first number plus 0.875. The fifth number is half of the first number minus 0.125. What are the five numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 27.0000000000000",
            "y  = 3.0 * x",
            "z  = 0.5 * y - 1.375",
            "w  = 0.5 * x + 0.875",
            "v  = 0.5 * x - 0.125"
        ],
        "ans": [
            "4.25",
            "12.75",
            "5",
            "3",
            "2"
        ],
        "id": "7"
    },
    {
        "problem": "You are tasked with creating a 70 ml solution using five different acetone solutions: 80%, 30%, 60%, 40%, and 50%. The total amount of acetone in the final solution should be 35 ml. Additionally, the sum of the amount of 80% acetone solution and the amount of 60% acetone solution should be 22 ml less than twice the amount of 30% acetone solution. The sum of the amount of 80% acetone solution, the amount of 30% acetone solution, and the amount of 60% acetone solution should be 20 ml more than three times the amount of 40% acetone solution. The sum of the amount of 80% acetone solution, the amount of 30% acetone solution, the amount of 60% acetone solution, and the amount of 40% acetone solution should be 20 ml more than four times the amount of 50% acetone solution. How much of each starting solution do you need?",
        "system_of_equations": [
            "(0.01 * 80.0) * x + (y) * 0.01 * 30.0 + (z) * 0.01 * 60.0 + (w) * 0.01 * 40.0 + (v) * 0.01 * 50.0  = 35.0000000000000",
            "x + y + z + w + v  = 70.0000000000000",
            "x + z  = 2 * y - 22.0",
            "x + y + z  = 3 * w + 20.0",
            "x + y + z + w  = 4 * v + 20.0"
        ],
        "ans": [
            "16",
            "24",
            "10",
            "10",
            "10"
        ],
        "id": "394"
    },
    {
        "problem": "Andy, Tom, their sister Mary, their cousin John, and their grandmother have a combined age of 111 years. Andy is 6 years older than Tom, Mary is 8 years younger than Andy, and John is 3 years younger than Tom. The grandmother is 29 years older than the combined age of Andy, Tom, Mary, and John. How old is each of them?",
        "system_of_equations": [
            "x + y + z + w + v  = 111.000000000000",
            "y  = x + 6.0",
            "z  = y - 8.0",
            "w  = x - 3.0",
            "v  = w + x + y + z + 29.0"
        ],
        "ans": [
            "10",
            "16",
            "8",
            "7",
            "70"
        ],
        "id": "361"
    },
    {
        "problem": "The sum of five consecutive odd integers is 325. Each odd integer is 2 more than the previous one. What are the integers?",
        "system_of_equations": [
            "x + y + z + w + v  = 325.000000000000",
            "y  = x + 2.0",
            "z  = y + 2.0",
            "w  = z + 2.0",
            "v  = w + 2.0"
        ],
        "ans": [
            "61",
            "63",
            "65",
            "67",
            "69"
        ],
        "id": "397"
    },
    {
        "problem": "The sum of five numbers is 200. The difference between the first and second number plus the third number plus the fourth number plus the fifth number is 76. Also, twice the first number plus the second number plus the fourth number plus the fifth number equals three times the third number plus 198. The sum of the first and second number plus the fifth number equals twice the fourth number plus 90. The sum of the first, second, third, and fourth numbers equals four times the fifth number plus 150. Find the numbers.",
        "system_of_equations": [
            "x + y + z + w + v  = 200.000000000000",
            "x - y + z + w + v  = 76.0000000000000",
            "2 * x + y + w + v  = 3 * z + 198.0",
            "x + y + v  = 2 * w + 90.0",
            "x + y + z + w  = 4 * v + 150.0"
        ],
        "ans": [
            "78",
            "62",
            "20",
            "30",
            "10"
        ],
        "id": "9"
    },
    {
        "problem": "At a fast food restaurant, one pan pizza, two cheeseburgers, one salad, and one chicken sandwich provide 3560 calories. Two pan pizzas, one cheeseburger, one salad, one chicken sandwich, and one serving of french fries provide 4290 calories. One pan pizza, one cheeseburger, two salads, one chicken sandwich, and one serving of french fries provide 3550 calories. Two pan pizzas, two cheeseburgers, one salad, one chicken sandwich, and one serving of french fries provide 5200 calories. One of each item plus an additional serving of french fries provide 3850 calories. Find the caloric content of each item.",
        "system_of_equations": [
            "1.0 * x + 2.0 * y + 1.0 * z + 1.0 * w + 0.0 * v  = 3560.00000000000",
            "2.0 * x + 1.0 * y + 1.0 * z + 1.0 * w + 1.0 * v  = 4290.00000000000",
            "1.0 * x + 1.0 * y + 2.0 * z + 1.0 * w + 1.0 * v  = 3550.00000000000",
            "2.0 * x + 2.0 * y + 1.0 * z + 1.0 * w + 1.0 * v  = 5200.00000000000",
            "1.0 * x + 1.0 * y + 1.0 * z + 1.0 * w + 2.0 * v  = 3850.00000000000"
        ],
        "ans": [
            "1040",
            "910",
            "300",
            "400",
            "600"
        ],
        "id": "3"
    },
    {
        "problem": "A real estate salesperson bought promotional calendars, date books, pens, keychains, and mugs to give to her customers at the end of the year. The calendars cost $0.75 each, the date books cost $0.50 each, the pens cost $0.25 each, the keychains cost $0.10 each, and the mugs cost $1.00 each. She ordered a total of 900 promotional items and spent $485. It is known that twice the number of calendars equals the sum of the number of mugs, keychains, date books, and pens. The number of calendars and date books combined equals the number of mugs plus three times the number of keychains plus 100. The number of calendars, date books, and pens combined equals four times the number of mugs plus 300. How many of each item did she order?",
        "system_of_equations": [
            "x + y + z + w + v  = 900.000000000000",
            "0.75 * x + 0.5 * y + 0.25 * z + 0.1 * w + 1.0 * v  = 485.000000000000",
            "2.0 * x  = v + w + y + z",
            "x + y  = v + 3.0 * w + 100.0",
            "x + y + z  = 4.0 * v + 300.0"
        ],
        "ans": [
            "300",
            "200",
            "200",
            "100",
            "100"
        ],
        "id": "11"
    },
    {
        "problem": "Tom has 22 coins in total, consisting of quarters, nickels, dimes, pennies, and half-dollars. The total value of these coins is $3.55. It is known that twice the number of nickels plus the number of quarters equals three times the number of dimes plus 7. The number of nickels, quarters, and dimes combined equals four times the number of pennies minus 5. The number of nickels, quarters, dimes, and pennies combined equals five times the number of half-dollars plus 10. How many coins of each type does Tom have?",
        "system_of_equations": [
            "0.05 * x + 0.25 * y + 0.10 * z + 0.01 * w + 0.50 * v  = 3.55000000000000",
            "x + y + z + w + v  = 22",
            "2.0 * x + y  = 3.0 * z + 7",
            "x + y + z  = 4.0 * w - 5.0",
            "x + y + z + w  = 5.0 * v + 10.0"
        ],
        "ans": [
            "4",
            "8",
            "3",
            "5",
            "2"
        ],
        "id": "379"
    },
    {
        "problem": "Five angles are in a certain relation. The measure of the second angle is 45 degrees less than two times the measure of the first angle. The sum of the first angle, the third angle, the fourth angle, and the fifth angle is 255 degrees. The sum of the measures of the five angles is 360 degrees. The sum of the first angle and the second angle is two times the measure of the fourth angle plus 60 degrees. The sum of the first angle, the second angle, and the third angle is three times the measure of the fifth angle plus 60 degrees. Find the measure of each angle.",
        "system_of_equations": [
            "x + y + z + w + v  = 360.000000000000",
            "2.0 * x - 45.0  = y",
            "x + z + w + v  = 255.000000000000",
            "x + y  = 2.0 * w + 60.0",
            "x + y + z  = 3.0 * v + 60.0"
        ],
        "ans": [
            "75",
            "105",
            "60",
            "60",
            "60"
        ],
        "id": "371"
    },
    {
        "problem": "There are five numbers. The largest number is 2 more than 4 times the smallest number. The sum of the five numbers is 55. Also, the largest number is 12.8 more than twice the third number. The sum of the smallest number and the largest number equals three times the fourth number plus 18. The sum of the smallest number, the largest number, and the third number equals four times the fifth number. Find the five numbers.",
        "system_of_equations": [
            "y  = 4.0 * x + 2.0",
            "x + y + z + w + v  = 55.0000000000000",
            "y  = 2.0 * z + 12.8",
            "x + y  = 3.0 * w + 18.0",
            "x + y + z  = 4.0 * v"
        ],
        "ans": [
            "6.2",
            "26.8",
            "7",
            "5",
            "10"
        ],
        "id": "48"
    },
    {
        "problem": "In December, Wal-Mart sold five types of items: thermometers for $2 each, hot-water bottles for $6 each, blankets for $10 each, scarves for $4 each, and gloves for $5 each. The total sales for the month amounted to $2150. It was observed that customers bought 7 times as many thermometers as hot-water bottles and half as many blankets as hot-water bottles. The number of scarves sold was half the number of thermometers sold minus 110. The number of gloves sold was half the number of hot-water bottles sold plus 20. How many of each item did Wal-Mart sell?",
        "system_of_equations": [
            "6.0 * x + 2.0 * y + 10.0 * z + 4.0 * w + 5.0 * v  = 2150.00000000000",
            "y  = 7.0 * x",
            "z  = 0.5 * x",
            "w  = 0.5 * y - 110.0",
            "v  = 0.5 * x + 20.0"
        ],
        "ans": [
            "60",
            "420",
            "30",
            "100",
            "50"
        ],
        "id": "366"
    },
    {
        "problem": "Suppose you have entered a 290 mile pentathlon that consists of a running race, a bicycle race, a swimming race, a kayaking race, and a hiking race. During your run, your velocity is 10 miles per hour, during your bicycle race, your velocity is 29 miles per hour, during your swimming race, your velocity is 5 miles per hour, during your kayaking race, your velocity is 4 miles per hour, and during your hiking race, your velocity is 2 miles per hour. You finish the race in 47.5 hours. Also, the distance of your run plus twice the distance of your bicycle race equals four times the distance of your swimming race plus 120 miles. The distance of your run plus the distance of your bicycle race plus the distance of your swimming race equals three times the distance of your kayaking race plus 50 miles. The distance of your run plus the distance of your bicycle race plus the distance of your swimming race plus the distance of your kayaking race equals six times the distance of your hiking race plus 10 miles. What is the distance of your run, your bicycle race, your swimming race, your kayaking race, and your hiking race?",
        "system_of_equations": [
            "x + y + z + w + v  = 290.000000000000",
            "( 1.0 / 10.0 ) * x + ( 1.0 / 29.0 ) * y + ( 1.0 / 5.0 ) * z + ( 1.0 / 4.0 ) * w + ( 1.0 / 2.0 ) * v  = 47.5000000000000",
            "x + 2.0 * y  = 4.0 * z + 120.0",
            "x + y + z  = 3.0 * w + 50.0",
            "x + y + z + w  = 6.0 * v + 10.0"
        ],
        "ans": [
            "10",
            "145",
            "45",
            "50",
            "40"
        ],
        "id": "382"
    },
    {
        "problem": "Erin, Susan, John, David, and Alex took their dogs for a walk. Together, they walked 32 miles. If Erin walked 3 miles less than Susan, and Susan walked 2 miles more than John plus 2 miles. The distance Susan and Erin walked together is 10 miles more than the distance David walked. The distance Erin, Susan, and John walked together is 13 miles more than the distance Alex walked. How far did each person walk with their dog?",
        "system_of_equations": [
            "x + y + z + w + v  = 32.0000000000000",
            "x - 3.0  = y",
            "x - 2.0  = z + 2.0",
            "x + y  = w + 10.0",
            "x + y + z  = v + 13.0"
        ],
        "ans": [
            "9",
            "6",
            "5",
            "5",
            "7"
        ],
        "id": "373"
    },
    {
        "problem": "Two brothers, Bill and Eric, are 4 years apart in age, with Bill being the older one. They have a sister named Sarah, a brother named Tom, and a cousin named Jake. The combined age of the five family members is 60 years. Bill is 6 years older than Sarah, 8 years older than Tom, and 2 years older than Jake. How old is each family member?",
        "system_of_equations": [
            "x - y  = 4.00000000000000",
            "x + y + z + w + v  = 60.0000000000000",
            "x - z  = 6.00000000000000",
            "x - w  = 8.00000000000000",
            "x - v  = 2.00000000000000"
        ],
        "ans": [
            "16",
            "12",
            "10",
            "8",
            "14"
        ],
        "id": "365"
    },
    {
        "problem": "Hollis is paying off five student loans. The first loan charges 7% interest per year, the second loan charges 9% interest per year, the third loan charges 5% interest per year, the fourth loan charges 3% interest per year, and the fifth loan charges 2% interest per year. He owes $1500 more on the first loan than he does on the second loan. Last year, he paid a total of $777 in interest. The total amount he owes on all five loans is $12400. The amount he owes on the first and second loans combined is $3900 more than four times the amount he owes on the fourth loan. The amount he owes on the first, second, and third loans combined is $900 more than six times the amount he owes on the fifth loan. How much does he owe on each loan?",
        "system_of_equations": [
            "( 0.01 * 7.0 ) * x + ( 0.01 * 9.0 ) * y + ( 0.01 * 5.0 ) * z + ( 0.01 * 3.0 ) * w + ( 0.01 * 2.0 ) * v  = 777.000000000000",
            "x  = y + 1500.0",
            "x + y + z + w + v  = 12400.0000000000",
            "x + y  = 4.0 * w + 3900.0",
            "x + y + z  = 6.0 * v + 900.0"
        ],
        "ans": [
            "4700",
            "3200",
            "2000",
            "1000",
            "1500"
        ],
        "id": "4"
    },
    {
        "problem": "Sawz Logging Co. bought a section of forest containing 1150 trees, which are a mix of Douglas fir, ponderosa pine, spruce, cedar, and maple trees. The company paid an average of $300 for each Douglas fir, $225 for each ponderosa pine, $200 for each spruce tree, $175 for each cedar tree, and $150 for each maple tree, amounting to a total of $272,500. It is known that the sum of the number of Douglas fir and ponderosa pine trees equals twice the number of spruce trees plus 550. The sum of the number of Douglas fir, ponderosa pine, and spruce trees equals three times the number of cedar trees plus 700. The sum of the number of Douglas fir, ponderosa pine, spruce, and cedar trees equals four times the number of maple trees plus 900. How many of each type of tree did the company buy?",
        "system_of_equations": [
            "y + z + w + v  = 1150.0 - x",
            "300.0 * x + 225.0 * y + 200.0 * z + 175.0 * w + 150.0 * v  = 272500.000000000",
            "x + y  = 2.0 * z + 550.0",
            "x + y + z  = 3.0 * w + 700.0",
            "x + y + z + w  = 4.0 * v + 900.0"
        ],
        "ans": [
            "350",
            "500",
            "150",
            "100",
            "50"
        ],
        "id": "45"
    },
    {
        "problem": "A man went to a store and bought 7 pounds of coffee, 10 pounds of butter, 5 pounds of sugar, and 2 pounds of tea for a total of $76.50. The next day, the prices had not changed and he bought 7 pounds of coffee, 5 pounds of butter, 2 pounds of sugar, 1 pound of tea, and 1 pound of salt for $48.75. He also noticed that the cost of 3 pounds of coffee, 2 pounds of butter, 1 pound of sugar, half a pound of tea, and 1 pound of salt is $21.50. Additionally, the cost of 2 pounds of coffee, 3 pounds of butter, 1 pound of sugar, 1 pound of tea, and 1 pound of salt is $24.25. The cost of 1 pound of each item plus an additional pound of salt is $14.75. Find the price per pound of coffee, butter, sugar, tea, and salt.",
        "system_of_equations": [
            "7.0 * x + 10.0 * y + 5.0 * z + 2.0 * w + 0.0 * v  = 76.5000000000000",
            "7.0 * x + 5.0 * y + 2.0 * z + 1.0 * w + 1.0 * v  = 48.7500000000000",
            "3.0 * x + 2.0 * y + z + 0.5 * w + 1.0 * v  = 21.5000000000000",
            "2.0 * x + 3.0 * y + 1.0 * z + 1.0 * w + 1.0 * v  = 24.2500000000000",
            "1.0 * x + 1.0 * y + 1.0 * z + 1.0 * w + 2.0 * v  = 14.7500000000000"
        ],
        "ans": [
            "3",
            "3.75",
            "2",
            "4",
            "1"
        ],
        "id": "376"
    },
    {
        "problem": "You have a sum of Rs 2100 in the denominations of Rs 10, Rs 20, Rs 5, Rs 50, and Rs 100 notes. The total number of notes is 75. It is known that twice the number of Rs 10 notes plus the number of Rs 20 notes equals four times the number of Rs 5 notes plus 30. The number of Rs 10 notes plus the number of Rs 20 notes plus the number of Rs 5 notes equals five times the number of Rs 50 notes plus 35. The number of Rs 10 notes plus the number of Rs 20 notes plus the number of Rs 5 notes plus the number of Rs 50 notes equals six times the number of Rs 100 notes plus 5. How many notes of each denomination do you have?",
        "system_of_equations": [
            "10.0 * x + 20.0 * y + 5.0 * z + 50.0 * w + 100.0 * v  = 2100.00000000000",
            "x + y + z + w + v  = 75.0000000000000",
            "2.0 * x + y  = 4.0 * z + 30.0",
            "x + y + z  = 5.0 * w + 35.0",
            "x + y + z + w  = 6.0 * v + 5.0"
        ],
        "ans": [
            "20",
            "30",
            "10",
            "5",
            "10"
        ],
        "id": "385"
    },
    {
        "problem": "Mike invested $12,000 for one year in five different ways: part at 9% annual interest, part at 11% annual interest, part at 7% annual interest, part at 5% annual interest, and the rest at 3% annual interest. After one year, he earned $924 in interest. Also, twice the amount invested at 9% annual interest plus the amount invested at 11% annual interest plus the amount invested at 5% annual interest plus the amount invested at 3% annual interest equals ten times the amount invested at 7% annual interest minus 8200 dollars. The amount invested at 9% annual interest plus the amount invested at 11% annual interest plus the amount invested at 3% annual interest equals four times the amount invested at 5% annual interest. The amount invested at 9% annual interest plus the amount invested at 11% annual interest plus the amount invested at 7% annual interest plus the amount invested at 5% annual interest equals five times the amount invested at 3% annual interest. How much did he invest at each rate?",
        "system_of_equations": [
            "( 0.01 * 9.0 ) * x + ( 0.01 * 11.0 ) * y + ( 0.01 * 7.0 ) * z + ( 0.01 * 5.0 ) * w + ( 0.01 * 3.0 ) * v  = 924.000000000000",
            "y + z + w + v  = 12000.0 - x",
            "2.0 * x + y + w + v  = 10.0 * z - 8200.0",
            "x + y + v  = 4.0 * w",
            "x + y + z + w  = 5.0 * v"
        ],
        "ans": [
            "1800",
            "4200",
            "2000",
            "2000",
            "2000"
        ],
        "id": "2"
    },
    {
        "problem": "Consider five numbers. Two times the first number plus three times the second number plus four times the third number plus five times the fourth number plus the fifth number equals 48. The sum of the five numbers is 16. Also, the first number plus twice the second number equals three times the third number plus 6. The sum of the first number, the second number, and the third number equals four times the fourth number plus 2. The sum of the first number, the second number, the third number, and the fourth number equals three times the fifth number. What are the five numbers?",
        "system_of_equations": [
            "2.0 * x + 3.0 * y + 4.0 * z + 5.0 * w + 1.0 * v  = 48.0000000000000",
            "x + y + z + w + v  = 16.0000000000000",
            "x + 2.0 * y  = 3.0 * z + 6.0",
            "x + y + z  = 4.0 * w + 2.0",
            "x + y + z + w  = 3.0 * v"
        ],
        "ans": [
            "-1",
            "8",
            "3",
            "2",
            "4"
        ],
        "id": "40"
    },
    {
        "problem": "In a class, the number of boys is 5 less than twice the number of girls. Including the teachers, staff, and administrators, there are 45 people in the class. The number of girls plus the number of teachers plus the number of staff plus the number of administrators equals 28. The number of girls plus the number of boys equals three times the number of staff plus 4. The number of girls plus the number of boys plus the number of teachers equals four times the number of administrators plus 12. How many boys, girls, teachers, staff members, and administrators are there in the class?",
        "system_of_equations": [
            "x + y + z + w + v  = 45.0000000000000",
            "2.0 * x - 5.0  = y",
            "x + z + w + v  = 28.0000000000000",
            "x + y  = 3.0 * w + 4.0",
            "x + y + z  = 4.0 * v + 12.0"
        ],
        "ans": [
            "11",
            "17",
            "4",
            "8",
            "5"
        ],
        "id": "396"
    },
    {
        "problem": "Consider five numbers. The sum of these numbers is 10. Eight times the first number plus five times the second number plus three times the third number plus two times the fourth number plus the fifth number equals 42. Also, twice the first number minus the second number plus the third number plus the fourth number plus half the fifth number equals 27. The sum of the first three numbers plus half the fifth number equals three times the fourth number minus four. The sum of the first four numbers equals two times the fifth number minus two. What are the five numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 10.0000000000000",
            "8.0 * x + 5.0 * y + 3.0 * z + 2.0 * w + 1.0 * v  = 42.0000000000000",
            "2.0 * x - y + z + w + 0.5 * v  = 27.0000000000000",
            "x + y + z + 0.5 * v  = 3.0 * w - 4.0",
            "x + y + z + w  = 2.0 * v - 2.0"
        ],
        "ans": [
            "7",
            "-6",
            "2",
            "3",
            "4"
        ],
        "id": "17"
    },
    {
        "problem": "Consider five numbers. The sum of these numbers is 152. The difference between the first number and the second number, plus the third number, plus the fourth number, plus the fifth number equals 28. Also, twice the first number plus the second number plus the fourth number plus the fifth number equals three times the third number plus 117. The sum of the first number and the second number plus the fifth number equals twice the fourth number plus the third number plus 82. The sum of the first number, the second number, the third number, and the fourth number equals four times the fifth number plus 77. Find the five numbers.",
        "system_of_equations": [
            "x + y + z + w + v  = 152.000000000000",
            "x - y + z + w + v  = 28.0000000000000",
            "2 * x + y + w + v  = 3 * z + 117.0",
            "x + y + v  = 2 * w + z + 82.0",
            "x + y + z + w  = 4 * v + 77.0"
        ],
        "ans": [
            "45",
            "62",
            "20",
            "10",
            "15"
        ],
        "id": "46"
    },
    {
        "problem": "The sum of five numbers is 115. The difference between the first number and the second number, plus the third number, plus the fourth number, plus the fifth number, is 25. Also, twice the first number plus the second number plus the fourth number plus the fifth number equals three times the third number plus 111. The sum of the first number and the second number plus the fifth number equals four times the fourth number plus 60. The sum of the first number, the second number, the third number, and the fourth number equals five times the fifth number plus 25. What are the five numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 115.000000000000",
            "x - y + z + w + v  = 25.0000000000000",
            "2.0 * x + y + w + v  = 3.0 * z + 111.0",
            "x + y + v  = 4.0 * w + 60.0",
            "x + y + z + w  = 5.0 * v + 25.0"
        ],
        "ans": [
            "36",
            "45",
            "10",
            "9",
            "15"
        ],
        "id": "6"
    },
    {
        "problem": "There are five numbers. The sum of three times the first number, twice the second number, the third number, half the fourth number, and half the fifth number is 12.5. If half of the third number, half of the fourth number, and half of the fifth number are added to the result of subtracting the second number from twice the first number, the result is 6.5. The sum of the five numbers is 10. The sum of the first and second numbers equals twice the fourth number minus 3. The sum of the first, second, and third numbers equals three times the fifth number minus 1. Find the numbers.",
        "system_of_equations": [
            "3.0 * x + 2.0 * y + 1.0 * z + 0.5 * w + 0.5 * v  = 12.5000000000000",
            "2.0 * x - y + 0.5 * z + 0.5 * w + 0.5 * v  = 6.50000000000000",
            "x + y + z + w + v  = 10.0000000000000",
            "x + y  = 2.0 * w - 3.0",
            "x + y + z  = 3.0 * v - 1.0"
        ],
        "ans": [
            "2",
            "1",
            "2",
            "3",
            "2"
        ],
        "id": "51"
    },
    {
        "problem": "A family of twelve, including a toddler, went to the San Diego Zoo. The total cost for their general admission tickets was $202. Adult tickets cost $21 each, children's tickets cost $14 each, senior tickets cost $18 each, student tickets cost $15 each, and toddler tickets cost $10 each. It is known that twice the number of adult tickets equals the sum of the number of toddler tickets, children's tickets, senior tickets, and student tickets. The number of adult tickets plus the number of children's tickets equals the sum of the number of toddler tickets, student tickets, senior tickets, and 2. The number of adult tickets, children's tickets, and senior tickets equals the sum of the number of toddler tickets, student tickets, and 6. How many of each type of tickets were purchased by the family?",
        "system_of_equations": [
            "21.0 * x + 14.0 * y + 18.0 * z + 15.0 * w + 10.0 * v  = 202.000000000000",
            "x + y + z + w + v  = 12.0000000000000",
            "2.0 * x  = v + w + y + z",
            "x + y  = v + w + z + 2.0",
            "x + y + z  = v + w + 6.0"
        ],
        "ans": [
            "4",
            "3",
            "2",
            "2",
            "1"
        ],
        "id": "29"
    },
    {
        "problem": "The sum of five numbers is 18. The greatest number is 3 more than twice the smallest number. The third number is 3 less than the greatest number. The fourth number is 1 more than the smallest number. The fifth number is equal to the smallest number. What are the numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 18.0000000000000",
            "y  = 2.0 * x + 3.0",
            "z  = y - 3.0",
            "w  = x + 1.0",
            "v  = x"
        ],
        "ans": [
            "2",
            "7",
            "4",
            "3",
            "2"
        ],
        "id": "388"
    },
    {
        "problem": "At a local theater, adult tickets for a play cost $16, child tickets cost $9, senior tickets cost $7, student tickets cost $5, and group tickets cost $10. In one performance, the theater had 38 attendees and collected $444 from ticket sales. It is known that twice the number of adult tickets equals the sum of the number of group tickets, the number of student tickets, the number of child tickets, three times the number of senior tickets, and 4. The number of adult tickets plus the number of child tickets equals the number of group tickets, twice the number of student tickets, twice the number of senior tickets. The number of adult tickets, child tickets, and senior tickets combined equals twice the number of group tickets, three times the number of student tickets, and 10. How many adults, children, seniors, students, and groups attended the play?",
        "system_of_equations": [
            "16.0 * x + 9.0 * y + 7.0 * z + 5.0 * w + 10.0 * v  = 444.000000000000",
            "x + y + z + w + v  = 38.0000000000000",
            "2.0 * x  = v + w + y + 3.0 * z + 4.0",
            "x + y  = v + 2.0 * w + 2.0 * z",
            "x + y + z  = 2.0 * v + 3.0 * w + 10.0"
        ],
        "ans": [
            "18",
            "6",
            "6",
            "4",
            "4"
        ],
        "id": "19"
    },
    {
        "problem": "You have $11.95 in change made up of quarters, dimes, nickels, pennies, and half-dollars. The total number of coins is 70. Also, twice the number of quarters plus the number of dimes equals five times the number of nickels plus 24. The number of quarters, dimes, and nickels combined equals five times the number of pennies plus 5. The number of quarters, dimes, nickels, and pennies combined equals ten times the number of half-dollars plus 15. How many quarters, dimes, nickels, pennies, and half-dollars do you have?",
        "system_of_equations": [
            "0.25 * x + 0.1 * y + 0.05 * z + 0.01 * w + 0.5 * v  = 11.9500000000000",
            "x + y + z + w + v  = 70",
            "2.0 * x + y  = 5.0 * z + 24",
            "x + y + z  = 5.0 * w + 5.0",
            "x + y + z + w  = 10.0 * v + 15.0"
        ],
        "ans": [
            "29",
            "16",
            "10",
            "10",
            "5"
        ],
        "id": "358"
    },
    {
        "problem": "Jenna, Darius, Alex, Bella, and their friend Charlie have a combined age of 45 years. Jenna is 5 years older than Darius, Alex is 6 years younger than Jenna, Bella is 3 years older than Darius, and Charlie is 1 year younger than Darius. How old are Jenna, Darius, Alex, Bella, and Charlie?",
        "system_of_equations": [
            "y  = x + 5.0",
            "x + y + z + w + v  = 45.0000000000000",
            "z  = y - 6.0",
            "w  = x + 2.0",
            "v  = x - 1.0"
        ],
        "ans": [
            "8",
            "13",
            "7",
            "10",
            "7"
        ],
        "id": "359"
    },
    {
        "problem": "Jack is three times as old as Jill. Together with their friends Bob, Alice, and Tom, their total age is 100 years. Bob is half as old as Jill plus 3 years. Alice is half as old as Jack minus 21 years. Tom is half as old as Jill plus 1 year. Find the age of each person.",
        "system_of_equations": [
            "x + y + z + w + v  = 100.0000000000000",
            "y  = 3.0 * x",
            "z  = 0.5 * x + 3.0",
            "w  = 0.5 * y - 21.0",
            "v  = 0.5 * x + 1.0"
        ],
        "ans": [
            "18",
            "54",
            "12",
            "6",
            "10"
        ],
        "id": "368"
    },
    {
        "problem": "42 is divided into five parts. 7 times the first part, 5 times the second part, 3 times the third part, 2 times the fourth part, and the fifth part equals 181. Also, the sum of the first part and the second part equals four times the third part. The sum of the first part, the second part, and the third part equals six times the fourth part. The sum of the first part, the second part, the third part, and the fourth part equals five times the fifth part. Find each part.",
        "system_of_equations": [
            "7.0 * x + 5.0 * y + 3.0 * z + 2.0 * w + 1.0 * v  = 181.000000000000",
            "x + y + z + w + v  = 42.0000000000000",
            "x + y  = 4.0 * z",
            "x + y + z  = 6.0 * w",
            "x + y + z + w  = 5.0 * v"
        ],
        "ans": [
            "13",
            "11",
            "6",
            "5",
            "7"
        ],
        "id": "372"
    },
    {
        "problem": "The sum of five numbers is 19. The first number is 5 less than the sum of the fifth number, the fourth number, twice the second number, and the third number. The third number is equal to the sum of the fifth number, the second number, and the negative of the fourth number. The first number is 5 less than the sum of the fifth number, three times the fourth number, the second number, and the third number. The sum of the first number, the second number, and the third number is equal to the sum of the fifth number, four times the fourth number, and seven. Find the smallest number.",
        "system_of_equations": [
            "x + y + z + w + v  = 19.0000000000000",
            "x  = v + w + 2.0 * y + z - 5.0",
            "z  = v - w + y",
            "x  = v + 3.0 * w + y + z - 5.0",
            "x + y + z  = v + 4.0 * w + 7.0"
        ],
        "ans": [
            "9",
            "4",
            "3",
            "2",
            "1"
        ],
        "id": "5"
    },
    {
        "problem": "The sum of five numbers is 125. One number is ten more than twice the second number. The third number is the difference of 100 and the sum of the first two numbers. The fourth number is the difference of the first number and the second number minus 20. The fifth number is the sum of the first and fourth numbers minus the second and third numbers plus 5. Find the numbers.",
        "system_of_equations": [
            "x + y + z + w + v  = 125",
            "x  = 2.0 * y + 10.0",
            "z  = -x - y + 100.0",
            "w  = x - y - 20.0",
            "v  = w + x - y - z + 5.0"
        ],
        "ans": [
            "50",
            "20",
            "30",
            "10",
            "15"
        ],
        "id": "28"
    },
    {
        "problem": "A wire 300 cm long is to be cut into five parts. One part is 32 cm longer than the second part, and the second part is 24 cm longer than the third part. The sum of the first part and the second part is twice the length of the fourth part plus 140 cm. The sum of the first part, the second part, and the third part is three times the length of the fifth part plus 80 cm. How long is each part?",
        "system_of_equations": [
            "x + y + z + w + v  = 300.000000000000",
            "x  = y + 32.0",
            "y  = z + 24.0",
            "x + y  = 2.0 * w + 140.0",
            "x + y + z  = 3.0 * v + 80.0"
        ],
        "ans": [
            "106",
            "74",
            "50",
            "20",
            "50"
        ],
        "id": "391"
    },
    {
        "problem": "There are five integers. If one integer is added to another and the third one and the fourth one and the fifth one, the result is 18. If the smallest integer is subtracted from the largest and the third one is also subtracted and the fourth one and the fifth one are added, the result is 12. Moreover, the sum of the largest integer, the third integer, the fourth integer, and the fifth integer equals 22. The sum of the largest integer, the smallest integer, the fourth integer, and the fifth integer equals 11. The sum of the largest integer, the smallest integer, the third integer, and the fifth integer equals 8. What are the integers?",
        "system_of_equations": [
            "x + y + z + w + v  = 18.0000000000000",
            "x - y - z + w + v  = 12.0000000000000",
            "x + z + w + v  = 22.0000000000000",
            "x + y + w + v  = 11.0000000000000",
            "x + y + z + v  = 8.00000000000000"
        ],
        "ans": [
            "-5",
            "-4",
            "7",
            "10",
            "10"
        ],
        "id": "363"
    },
    {
        "problem": "Maria, Kate, John, their cousin Tom, and their aunt Linda are family members. Currently, Maria is four times as old as Kate. However, four years ago, Maria was six times as old as Kate was at that time. John, their younger brother, is half as old as Maria. Tom, their cousin, is 5 years older than Maria. Linda, their aunt, is 10 years older than Maria. Can you find out the current ages of Maria, Kate, John, Tom, and Linda?",
        "system_of_equations": [
            "y  = 4.0 * x",
            "y - 4.0  = 6.0 * x - 24.0",
            "z  = 0.5 * y",
            "w  = y + 5.0",
            "v  = y + 10.0"
        ],
        "ans": [
            "10",
            "40",
            "20",
            "45",
            "50"
        ],
        "id": "356"
    },
    {
        "problem": "Keil is preparing for a big party and plans to make 22 pounds of mixed nuts. He wants to include peanuts, which cost 2.00 per pound, fancy nuts, which cost 7.50 per pound, almonds, which cost 3.00 per pound, cashews, which cost 4.00 per pound, and walnuts, which cost 1.50 per pound. Keil has a budget of 93.00 for the nuts. He also knows that the combined weight of the fancy nuts and peanuts should be the weight of the walnuts plus the weight of the cashews plus twice the weight of the almonds plus 1 pound. The combined weight of the fancy nuts, peanuts, almonds, and cashews should be four times the weight of the walnuts plus 2 pounds. How many pounds of each type of nut should Keil buy?",
        "system_of_equations": [
            "y + z + w + v  = 22.0 - x",
            "7.5 * x + 2.0 * y + 3.0 * z + 4.0 * w + 1.5 * v  = 93.0000000000000",
            "x + y  = v + w + 2.0 * z + 1.0",
            "x + y + z  = v + 3.0 * w + 6.0",
            "x + y + z + w  = 4.0 * v + 2.0"
        ],
        "ans": [
            "8",
            "5",
            "3",
            "2",
            "4"
        ],
        "id": "26"
    },
    {
        "problem": "In the United States, the number of cats exceeds the dog population by 7.5 million. When considering the number of cats, dogs, birds, fish, and reptiles combined, the total reaches 177.7 million. Furthermore, the sum of the number of cats and birds is twice the number of dogs minus 26.1 million. The sum of the number of cats, dogs, and fish is three times the number of birds plus 84.7 million. The sum of the number of cats, dogs, birds, and reptiles is four times the number of fish plus 27.7 million. Determine the number of dogs, cats, birds, fish, and reptiles in the United States.",
        "system_of_equations": [
            "x  = y + 7.5",
            "x + y + z + w + v  = 177.700000000000",
            "x + z  = 2.0 * y - 26.1",
            "x + y + w  = 3.0 * z + 84.7",
            "x + y + z + v  = 4.0 * w + 27.7"
        ],
        "ans": [
            "61.1",
            "53.6",
            "20",
            "30",
            "13"
        ],
        "id": "387"
    },
    {
        "problem": "A basketball team was scheduled to play 85 games in a season, but 5 games were cancelled. They won 5 more games than the total of the games they lost, tied, went into overtime, and were cancelled. Also, twice the number of games they won equals the number of games that were cancelled plus the number of games they lost plus three times the number of games they tied plus the number of games that went into overtime plus 34. The number of games they won plus the number of games they lost equals the number of games that were cancelled plus twice the number of games that went into overtime plus 37. The number of games they won plus the number of games they lost plus the number of games they tied equals three times the number of games that were cancelled plus 55. How many games did they win, lose, tie, go into overtime, and were cancelled?",
        "system_of_equations": [
            "x + y + z + w + v  = 85.0000000000000",
            "x  = v + w + y + z + 5.0",
            "2.0 * x  = v + w + y + 3.0 * z + 34.0",
            "x + y  = v + 2.0 * w + 37.0",
            "x + y + z  = 3.0 * v + 55.0"
        ],
        "ans": [
            "45",
            "17",
            "8",
            "10",
            "5"
        ],
        "id": "386"
    },
    {
        "problem": "The sum of five consecutive odd integers is at least 105. The difference between the first and second odd integer is -2, the difference between the third and second odd integer is 2, the difference between the fourth and third odd integer is also 2, and the difference between the fifth and fourth odd integer is 2. What are the integers?",
        "system_of_equations": [
            "x + y + z + w + v  = 105.0000000000000",
            "x - y  = -2.00000000000000",
            "z - y  = 2.00000000000000",
            "w - z  = 2.00000000000000",
            "v - w  = 2.00000000000000"
        ],
        "ans": [
            "17",
            "19",
            "21",
            "23",
            "25"
        ],
        "id": "364"
    },
    {
        "problem": "The sum of five numbers is 55. The difference between the first number and the second number, plus the third number, plus the fourth number, plus the fifth number is 29. Also, the sum of the first and second numbers minus twice the third number plus the fourth number plus the fifth number equals 25. The sum of the first, second, third, and fourth numbers equals three times the fifth number plus 15. The sum of the first, second, and third numbers equals four times the fifth number minus 2. What are the five numbers?",
        "system_of_equations": [
            "x + y + z + w + v  = 55.0000000000000",
            "x - y + z + w + v  = 29.0000000000000",
            "x + y - 2*z + w + v  = 25.0000000000000",
            "x + y + z + w  = 3 * v + 15.0",
            "x + y + z  = 4 * v - 2.0"
        ],
        "ans": [
            "15",
            "13",
            "10",
            "7",
            "10"
        ],
        "id": "355"
    },
    {
        "problem": "In a family, an older person is 7 years older than four times the age of a younger person. There is also a third person who is 3 years older than half the age of the younger person. A fourth person is 5.5 years younger than half the age of the older person. There is a fifth person who is twice the age of the younger person. The sum of their ages is 46 years. Find the ages of each person.",
        "system_of_equations": [
            "x + y + z + w + v  = 46.0000000000000",
            "y  = 4.0 * x + 7.0",
            "z  = 0.5 * x + 3.0",
            "w  = 0.5 * y - 5.5",
            "v  = 2.0 * x"
        ],
        "ans": [
            "4",
            "23",
            "5",
            "6",
            "8"
        ],
        "id": "369"
    },
    {
        "problem": "In printing an article of 66,000 words, a printer decides to use five sizes of type. Using the larger type, a printed page contains 1,800 words. Using smaller type, a page contains 2,400 words. Using medium type, a page contains 2,000 words. Using extra-large type, a page contains 1,500 words. Using mini type, a page contains 3,000 words. The article is allotted 29 full pages in a magazine. The printer finds that the number of pages in smaller type plus twice the number of pages in larger type equals three times the number of pages in medium type plus 16. The number of pages in smaller type plus the number of pages in larger type plus the number of pages in medium type equals four times the number of pages in extra-large type plus 16. The number of pages in smaller type plus the number of pages in larger type plus the number of pages in medium type plus the number of pages in extra-large type equals five times the number of pages in mini type plus 11. How many pages must be in each type?",
        "system_of_equations": [
            "2400.0 * x + 1800.0 * y + 2000.0 * z + 1500.0 * w + 3000.0 * v  = 66000.0000000000",
            "x + y + z + w + v  = 29.0000000000000",
            "x + 2.0 * y  = 3.0 * z + 16.0",
            "x + y + z  = 4.0 * w + 16.0",
            "x + y + z + w  = 5.0 * v + 11.0"
        ],
        "ans": [
            "17",
            "4",
            "3",
            "2",
            "3"
        ],
        "id": "52"
    },
    {
        "problem": "In a family, the father is currently twice as old as his daughter. Ten years ago, he was three times as old as she was. The mother is ten years older than the father. The son is half the age of the daughter plus five years. The grandmother is 20 years older than the mother. How old are the father, the mother, the daughter, the son, and the grandmother now?",
        "system_of_equations": [
            "x  = 2.0 * y",
            "x - 10.0  = 3.0 * y - 30.0",
            "z  = x + 10",
            "w  = 0.5 * y + 5.0",
            "v  = z + 20"
        ],
        "ans": [
            "40",
            "20",
            "50",
            "15",
            "70"
        ],
        "id": "380"
    },
    {
        "problem": "Gary drove to Sarnia. Part of the trip was along major highways, part was along country roads, part was in the city, part was on a ferry, and the rest was on a dirt road. The speed limit is 100 km/h on the highways, 80 km/h on the country roads, 60 km/h in the city, 20 km/h on the ferry, and 40 km/h on the dirt road. He spent a total of 18 hours driving 1310 km. Also, twice the time spent on the highways equals the sum of the time spent on the ferry, country roads, in the city, and on the dirt road minus 4.5 hours. The time spent on the highways plus the time spent on country roads equals the time spent on the dirt road plus three times the time spent on the ferry plus 5 hours. The time spent on the highways plus the time spent on country roads plus the time spent in the city equals twice the time spent on the dirt road plus four times the time spent on the ferry plus 5 hours. How much time did he spend on each type of road and on the ferry?",
        "system_of_equations": [
            "x + y + z + w + v  = 18.0000000000000",
            "100.0 * x + 80.0 * y + 60.0 * z + 20.0 * w + 40.0 * v  = 1310.00000000000",
            "2.0 * x  = v + w + y + z - 4.5",
            "x + y  = v + 3.0 * w + 5.0",
            "x + y + z  = 2.0 * v + 4.0 * w + 5.0"
        ],
        "ans": [
            "4.5",
            "7.5",
            "3",
            "2",
            "1"
        ],
        "id": "34"
    },
    {
        "problem": "There are five numbers. The difference between the larger number and the smaller number, plus the third number, plus the fourth number, plus half the fifth number equals 41. Three times the larger number equals half the fifth number plus the fourth number plus nine times the smaller number plus the third number minus 25. The sum of the larger number and the smaller number equals half the fifth number plus the fourth number plus twice the third number minus 5. The sum of the larger number, the smaller number, and the third number equals half the fifth number plus three times the fourth number plus 11. The sum of the larger number, the smaller number, the third number, and the fourth number equals four times the fifth number plus 30. What are the five numbers?",
        "system_of_equations": [
            "x - y + z + w + 0.5 * v  = 41.0000000000000",
            "3.0 * x  = 0.5 * v + w + 9.0 * y + z - 25.0",
            "x + y  = 0.5 * v + w + 2.0 * z - 5.0",
            "x + y + z  = 0.5 * v + 3.0 * w + 11.0",
            "x + y + z + w  = 4.0 * v + 30.0"
        ],
        "ans": [
            "24",
            "8",
            "12",
            "10",
            "6"
        ],
        "id": "38"
    },
    {
        "problem": "For a party, tickets were sold at different prices: $15 for adults, $10 for children, $5 for seniors, $8 for students, and $20 for VIPs. In total, 200 tickets were sold, collecting $2560. It is known that twice the number of adult tickets equals eight times the number of student tickets plus five times the number of senior tickets minus 60. The number of adult tickets plus the number of child tickets equals four times the number of student tickets plus 60. The number of adult tickets plus the number of child tickets plus the number of senior tickets equals five times the number of VIP tickets plus 60. How many adult, child, senior, student, and VIP tickets were sold?",
        "system_of_equations": [
            "15.0 * x + 10.0 * y + 5.0 * z + 8.0 * w + 20.0 * v  = 2560.00000000000",
            "x + y + z + w + v  = 200.000000000000",
            "2.0 * x  = 8.0 * w + 5.0 * z - 60.0",
            "x + y  = 4.0 * w + 60.0",
            "x + y + z  = 5.0 * v + 60.0"
        ],
        "ans": [
            "100",
            "40",
            "20",
            "20",
            "20"
        ],
        "id": "42"
    },
    {
        "problem": "There are five numbers. One number is 4 more than twice the second number. The total of the five numbers is 50. Also, the first number minus the second number equals three times the third number minus 4. The sum of the first and second number equals twice the fourth number plus 5. The sum of the first, second, and third number equals three times the fifth number. Find the numbers.",
        "system_of_equations": [
            "2.0 * y + 4.0  = x",
            "x + y + z + w + v  = 50.0000000000000",
            "x - y  = 3.0 * z - 4.0",
            "x + y  = 2.0 * w + 5.0",
            "x + y + z  = 3.0 * v"
        ],
        "ans": [
            "18",
            "7",
            "5",
            "10",
            "10"
        ],
        "id": "21"
    }
]